cases/baseCase_sensitivity_originalCurve/constant/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvConstraints;
}
